# Question 1 - SQL

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

## Prepare

Create Table

In [25]:
%%sql
DROP TABLE IF EXISTS user_actions;
CREATE TABLE user_actions (ds String,
                           user_id Integer,
                           post_id Integer,
                           action String,
                           extra String,
                          time_1 Integer,
                          time_2 Integer)

 * sqlite://
Done.
Done.

[]

Insert values

In [26]:
%%sql
DELETE FROM user_actions;
INSERT INTO user_actions VALUES
('2018-07-01', 1209283021, 329482048384792 , 'view', NULL,1,2),
('2018-07-01', 1209283021, 329482048384792 , 'like', NULL,1,2),
('2018-07-01', 1938409273, 349573908750923 , 'reaction', 'LOVE',1,3),
('2018-07-01', 1209283021, 329482048384792 , 'comment' , 'Such nice Raybans',1,3),
('2018-07-01', 1238472931, 329482048384792 , 'report', 'SPAM',1,4),
('2018-07-01', 1238712388, 328472938472087 , 'report', 'NUDITY',1,4),
('2018-07-01', 1238712388, 329482048384792 , 'reshare', 'I wanted to share with you all',1,5);

 * sqlite://
0 rows affected.
7 rows affected.

[]

In [48]:
%%sql
DROP TABLE IF EXISTS remove;
CREATE TABLE  remove (post_id Integer,
                          review_id Integer)

 * sqlite://
Done.
Done.

[]

Insert values

In [49]:
%%sql
DELETE FROM remove;
INSERT INTO remove VALUES
(329482048384792,1), (328472938472087,2)

 * sqlite://
0 rows affected.
2 rows affected.

[]

In [27]:
%%sql
select * from user_actions

 * sqlite://
Done.

[('2018-07-01', 1209283021, 329482048384792, 'view', None, 1, 2),
 ('2018-07-01', 1209283021, 329482048384792, 'like', None, 1, 2),
 ('2018-07-01', 1938409273, 349573908750923, 'reaction', 'LOVE', 1, 3),
 ('2018-07-01', 1209283021, 329482048384792, 'comment', 'Such nice Raybans', 1, 3),
 ('2018-07-01', 1238472931, 329482048384792, 'report', 'SPAM', 1, 4),
 ('2018-07-01', 1238712388, 328472938472087, 'report', 'NUDITY', 1, 4),
 ('2018-07-01', 1238712388, 329482048384792, 'reshare', 'I wanted to share with you all', 1, 5)]

## Run query

In [45]:
%%sql
SELECT extra as reason, COUNT(*) FROM user_actions 
WHERE action = 'report'
GROUP BY extra
ORDER BY COUNT(*) DESC
LIMIT 5

 * sqlite://
Done.

[('NUDITY', 1), ('SPAM', 1)]

In [81]:
%%sql
SELECT t1.user_id, t2.num_report * 1.00 / t1.num_record as p FROM

(select user_id, COUNT(*) as num_record FROM user_actions GROUP BY user_id) as t1
LEFT JOIN 
(select user_id, COUNT(*) as num_report FROM user_actions WHERE action = 'report' GROUP BY user_id) as t2
ON t1.user_id = t2.user_id

 * sqlite://
Done.

[(1209283021, None), (1238472931, 1.0), (1238712388, 0.5), (1938409273, None)]

In [82]:
%%sql
select sum(t1.num_unique_actions)*1.0/count(*) as avg_action from
(SELECT ds, user_id, COUNT(DISTINCT action) as num_unique_actions from
user_actions
GROUP BY user_id, ds) as t1

 * sqlite://
Done.

[(1.75,)]

In [83]:
%%sql
select time_2-time_1, count(*) as number_of_record from
user_actions
group by time_2-time_1

 * sqlite://
Done.

[(1, 2), (2, 2), (3, 2), (4, 1)]

In [84]:
%%sql
SELECT DATE('now', '-1 days')

 * sqlite://
Done.

[('2018-11-04',)]

In [85]:
%%sql
select 
count(*) * 1.0 / (select count(distinct post_id) from user_actions) from
(select DISTINCT user_actions.post_id as id_1, remove.post_id as id_2
FROM user_actions 
INNER JOIN remove
on user_actions.post_id = remove.post_id) as t1

 * sqlite://
Done.

[(0.6666666666666666,)]

In [117]:
%%sql
select a.post_id, count(*) from user_actions as a
LEFT JOIN
remove as b
on a.post_id - b.post_id >=-1000000000
where a.time_2=4 and b.review_id<3
GROUP BY a.post_id

 * sqlite://
Done.

[(328472938472087, 1), (329482048384792, 2)]

In [119]:
%%sql
select sum(case when extra is null then 1 else 0 end) from user_actions

 * sqlite://
Done.

[(2,)]

In [124]:
%%sql
select * from user_actions as a
INNER JOIN
remove as b
on a.post_id = b.post_id and b.review_id=1

 * sqlite://
Done.

[('2018-07-01', 1209283021, 329482048384792, 'comment', 'Such nice Raybans', 1, 3, 329482048384792, 1),
 ('2018-07-01', 1209283021, 329482048384792, 'like', None, 1, 2, 329482048384792, 1),
 ('2018-07-01', 1209283021, 329482048384792, 'view', None, 1, 2, 329482048384792, 1),
 ('2018-07-01', 1238472931, 329482048384792, 'report', 'SPAM', 1, 4, 329482048384792, 1),
 ('2018-07-01', 1238712388, 329482048384792, 'reshare', 'I wanted to share with you all', 1, 5, 329482048384792, 1)]